# IsValidFieldIndex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsValidFieldIndex Method
ScheduleDefinition Class See Also
---
Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidFieldIndex(
	int index
)
```

Visual Basic
---
```text
Public Function IsValidFieldIndex ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidFieldIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The field index to check.
# ### Return Value
True if the field index is valid, false otherwise.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace